app/controllers/products_controller.rb

SELECT "stock_locations".* FROM "stock_locations"
---
  def new
    @product = Product.new

    StockLocation.all.each do |s|

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "stock_levels".* FROM "stock_levels" WHERE "stock_levels"."product_id" = 1
---
  def edit
    @product = Product.find(params[:id])

    StockLocation.all.each do |s|
      if !StockLevel.exists?(:product_id => params[:id].to_i, :stock_location_id =>s.id)

INSERT INTO "products" ("cost", "created_at", "description", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    #raise params.inspect
    @product = Product.new(params[:product])

    params[:stock_level].each do |sl_id, sl|
      @product.stock_levels.build(:stock_location => StockLocation.find(sl_id.to_i), :quanity =>sl[:quanity], :threshold => sl[:threshold])
    end

    respond_to do |format|
      if @product.save