app/controllers/stock_locations_controller.rb

  def index
    @stock_locations = StockLocation.all
---
SELECT "stock_locations".* FROM "stock_locations"

  def show
    @stock_location = StockLocation.find(params[:id])
---
SELECT "stock_locations".* FROM "stock_locations" WHERE "stock_locations"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @stock_location = StockLocation.new(params[:stock_location])

    respond_to do |format|
      if @stock_location.save
---
INSERT INTO "stock_locations" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 14 Aug 2012 05:11:09 UTC +00:00], ["name", "Warehouse"], ["updated_at", Tue, 14 Aug 2012 05:11:09 UTC +00:00]]