app/views/products/_form.html.erb


  <% @product.stock_levels.each do |s| %>
---
SELECT "stock_levels".* FROM "stock_levels" WHERE "stock_levels"."product_id" = 1